from django.db import models


choices_time = (
    ('1:00-2:00', '1:00-2:00'),
    ('2:00-3:00', '2:00-3:00'),
    ('3:00-4:00', '3:00-4:00'),
    ('4:00-5:00', '4:00-5:00'),
    ('5:00-6:00', '5:00-6:00'),
    ('6:00-7:00', '6:00-7:00'),
    ('7:00-8:00', '7:00-8:00'),
    ('8:00-9:00', '8:00-9:00'),
    ('9:00-10:00', '9:00-10:00'),
    ('10:00-11:00', '10:00-11:00'),
    ('11:00-12:00', '11:00-12:00'),
    ('12:00-13:00', '12:00-13:00'),
    ('13:00-14:00', '13:00-14:00'),
    ('14:00-15:00', '14:00-15:00'),
    ('15:00-16:00', '15:00-16:00'),
    ('16:00-17:00', '16:00-17:00'),
    ('17:00-18:00', '17:00-18:00'),
    ('18:00-19:00', '18:00-19:00'),
    ('19:00-20:00', '19:00-20:00'),
    ('20:00-21:00', '20:00-21:00'),
    ('21:00-22:00', '21:00-22:00'),
    ('22:00-23:00', '22:00-23:00'),
    ('23:00-24:00', '23:00-24:00')
)

choices_days = (
    ('Monday', 'Понедельник'),
    ('Tuesday', 'Вторник'),
    ('Wednesday', 'Среда'),
    ('Thursday', 'Четверг'),
    ('Friday', 'Пятница'),
    ('Saturday', 'Суббота'),
)

class Times(models.Model):
    """
    Model times
    """
    time = models.CharField(
        choices=choices_time,
        verbose_name='Время',
    )
    day = models.CharField(
        choices=choices_days,
        verbose_name='День'
    )

    def __str__(self) -> str:
        return self.time
    
    def __repr__(self) -> str:
        return f'Times: time={self.time}, day={self.day}'

    class Meta:
        verbose_name = 'Время'
        verbose_name_plural = 'Время'